wondersure/NRF5-based-BLE-low-power-camera/main.c
/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
// *** Some Code
void uart_error_handle(app_uart_evt_t * p_event)
{
    if (p_event->evt_type == APP_UART_COMMUNICATION_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_communication);
    }
    else if (p_event->evt_type == APP_UART_FIFO_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_code);
    }
}

// *** Some Code
#define UART_HWFC APP_UART_FLOW_CONTROL_DISABLED
void uart_init()
{
		uint32_t err_code;
    const app_uart_comm_params_t comm_params =
      {
          MY_RX,	// RX
          MY_TX,	// TX
          RTS_PIN_NUMBER,	CTS_PIN_NUMBER,	UART_HWFC,	false,
					NRF_UART_BAUDRATE_115200
      };

    APP_UART_FIFO_INIT(&comm_params,
                         UART_RX_BUF_SIZE,
                         UART_TX_BUF_SIZE,
                         uart_error_handle,
                         APP_IRQ_PRIORITY_LOWEST,
                         err_code);

    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


///**@brief Function for initializing buttons and leds.
// *
// * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
// */
//static void buttons_leds_init(bool * p_erase_bonds)
//{
//    bsp_event_t startup_event;

//    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
//    APP_ERROR_CHECK(err_code);

//    err_code = bsp_btn_ble_init(NULL, &startup_event);
//    APP_ERROR_CHECK(err_code);

//    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
//}


/**@brief Function for initializing the nrf log module.
 */

static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}


/**@brief Application main function.
 */

void conn_evt_len_ext_set(bool status)
{
    ret_code_t err_code;
    ble_opt_t  opt;

    memset(&opt, 0x00, sizeof(opt));
    opt.common_opt.conn_evt_ext.enable = status ? 1 : 0;

    err_code = sd_ble_opt_set(BLE_COMMON_OPT_CONN_EVT_EXT, &opt);
    APP_ERROR_CHECK(err_code);
}


// *** Here I write a function to set connection interval
ret_code_t my_update_connection_interval(uint16_t ts)
{
	
#if	1	
		ble_gap_conn_params_t conn_params;

    conn_params.min_conn_interval = MSEC_TO_UNITS(ts*1.25, UNIT_1_25_MS);
    conn_params.max_conn_interval = MSEC_TO_UNITS(ts*1.25, UNIT_1_25_MS);
    conn_params.slave_latency     = SLAVE_LATENCY;
    conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

		NRF_LOG_INFO("I try to change interval as %d",ts);
    return sd_ble_gap_conn_param_update(m_conn_handle, &conn_params);
#endif
	
#if	0	
		ble_gap_conn_params_t   gap_conn_params;
  	uint32_t                err_code;
	  memset(&gap_conn_params, 0, sizeof(gap_conn_params));
 
    gap_conn_params.min_conn_interval = MSEC_TO_UNITS(ts*1.25, UNIT_1_25_MS);
    gap_conn_params.max_conn_interval = MSEC_TO_UNITS(ts*1.25, UNIT_1_25_MS);
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;
 
    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
		return err_code;
#endif

}
void set_mtu(uint16_t siz)
{
	
#if	1	
		NRF_LOG_INFO("Change MTU as %d",siz);
		//nrf_ble_gatt_data_length_set(&m_gatt, BLE_CONN_HANDLE_INVALID, siz);
		ret_code_t err_code = nrf_ble_gatt_data_length_set(&m_gatt, m_conn_handle, siz);
    NRF_LOG_INFO("Message %d.", err_code);
#endif

}




uint8_t Frame_Buffer[ HM01B0_X_NUM * HM01B0_Y_NUM + 13];

#define BLE_NUS_LENGTH            244 
void ble_send_data(uint8_t *senddata,int data_length)
{
	ret_code_t err_code;
	uint16_t length =0;
	uint16_t loop=0;
	
	for(loop =0;loop < data_length;)
		{
			if(0 == ble_connected_flag)return;
			if(data_length - loop >= BLE_NUS_LENGTH)
			{
				 length = BLE_NUS_LENGTH;
			}
			else length = (data_length - loop);
		 
		
#if 1
			ble_gatts_hvx_params_t const hvx_param =
			{
				.type   = BLE_GATT_HVX_NOTIFICATION,
				.handle = m_nus.tx_handles.value_handle,
				.p_data = senddata + loop,
				.p_len  = &length,
			};
			err_code = sd_ble_gatts_hvx(m_conn_handle, &hvx_param);
#endif		

#if	0
		 err_code = ble_nus_data_send(&m_nus, senddata+loop, &length, m_conn_handle);
#endif
		
		if(err_code != NRF_ERROR_NOT_FOUND 
		 && err_code != NRF_ERROR_INVALID_PARAM
		 && err_code != NRF_ERROR_RESOURCES)
		{
				//APP_ERROR_CHECK(err_code);
		}
		if(err_code == NRF_SUCCESS)
		{
			loop += length;
			//NRF_LOG_INFO("ble_nus_data_send:reslut %d %d\r\n",length,err_code);
		}
		//nrf_delay_ms(2);
	}
}

// *** JPEG encode
#include "fifo.h"
#include "img.h"
#define SIZE_RING_BUF       16384

uint8_t IMGDATA[HM01B0_X_NUM * 8];
uint8_t JPEG_Buffer[ SIZE_RING_BUF ];

uint8_t pictute_head[7]={112,114,101,109,HM01B0_X_NUM>>8,(uint8_t)HM01B0_X_NUM,HM01B0_Y_NUM};
uint8_t pictute_end[6]={0x46,0x49,0x4E,0x49,0x53,0x48};
		
int encode_image( void ) 
{
    uint8_t block[64];
    FIFO fifo;
    Image img;
    FIFO_init(&fifo, JPEG_Buffer + sizeof(pictute_head) , SIZE_RING_BUF );
	
	
    IMG_init(&img, HM01B0_X_NUM, (HM01B0_Y_NUM), IMG_Q_MED);
    IMG_encodeHeader(&img, &fifo);
	
