wondersure/NRF5-based-BLE-low-power-camera/main.c
    for (int l = 0; l < (HM01B0_Y_NUM) / 8; l++) 
		{
        //uart_recv(IMGDATA, 256 * 8);
				memcpy(IMGDATA,	Frame_Buffer + l*8*HM01B0_X_NUM,	(HM01B0_X_NUM * 8) );
			
        for (int i = 0; i < 8; i += 8) 
				{
					for (int j = 0; j < HM01B0_X_NUM; j += 8) 
					{
						for (int k = 0; k < 8; k++) 
						{
							memcpy(block + k * 8, &IMGDATA[(i + k) * HM01B0_X_NUM + j], 8);
						}
						// the current image data to Block and encode the block
						IMG_encodeBlock(&img, block, &fifo);
					}
        }
        //uart_fifo_send(&fifo);
    }
		
		IMG_encodeComplete(&img, &fifo);
		
		//JPEG_Buffer[FIFO_size(&fifo)-1] = 0xff;
		
		return FIFO_size(&fifo);
}


int main(void)
{
		hm01b0_ae_cfg_t       aecfg;

		

		// Uart Initialize.
    // uart_init();
	  log_init();
		
		hm01b0_init();			// HM01B0 Related Initialize.
//		hm01b0_cal_ae(10,Frame_Buffer+7,sizeof(Frame_Buffer)-13,&aecfg);
    NRF_LOG_INFO("Camera Phe init Done.\r\n");
		
	  NRF_LOG_INFO("Init 0");
	  // HM01B0 Related Initialize.
		timers_init();
	  NRF_LOG_INFO("Init 1");
	
    power_management_init();
		
	  NRF_LOG_INFO("Init 11");
		
    ble_stack_init();
		
	  NRF_LOG_INFO("Init 2");
		
		// Connect interaval explore
		conn_evt_len_ext_set(true);
		
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    advertising_start();
	
    NRF_LOG_INFO("BLE Phe init Done.\r\n");
	  NRF_LOG_INFO("Init is Done");
		



	
	  //memcpy(Frame_Buffer,pictute_head,sizeof(pictute_head));
		//memcpy(Frame_Buffer+sizeof(Frame_Buffer)-sizeof(pictute_end),pictute_end,sizeof(pictute_end));
		
		uint8_t     ui8Mode     = 0xFF;
		hm01b0_get_ae(&aecfg);
		hm01b0_get_mode(&ui8Mode);
		NRF_LOG_INFO("HM01B0 current mode %d\n", ui8Mode);
		hm01b0_cmd_update();
		hm01b0_set_mode(HM01B0_REG_MODE_SELECT_STREAMING,1);	
		
		
		for(int i=0;i<HM01B0_Y_NUM;i++)
		{}
		
		NRF_LOG_FLUSH();
		for (;;)
    {
        idle_state_handle();
			  NRF_LOG_INFO("Get_picturer_handler");
			
	      if(ble_connected_flag)
				{
					
					//nrf_gpio_pin_set(TRIG);
					hm01b0_spiread_oneframe(Frame_Buffer+7, sizeof(Frame_Buffer)-13);
					//nrf_gpio_pin_clear(TRIG);
					
					
					int jpeg_size = encode_image();
					memcpy( JPEG_Buffer, pictute_head, sizeof(pictute_head) );
					memcpy( JPEG_Buffer + jpeg_size - sizeof(pictute_end), pictute_end, sizeof(pictute_end));
					
					ble_send_data( JPEG_Buffer, jpeg_size );
					
					//my_update_connection_interval(15);
					
					//NRF_LOG_INFO("Current CI range: %d-%d x 1.25ms", m_current_conn_params.min_conn_interval, m_current_conn_params.max_conn_interval);
					//ble_send_data(Frame_Buffer,sizeof(Frame_Buffer));
					//nrf_delay_ms(200);
					
				}
				
			  //comperssio_main();
//			  nrf_delay_ms(2000);
			}
}


/**
 * @}
 */
